Merge pull request #31 from BansheeEmperor/rename-vision-captioning-to-true-sight
Rename vision captioning to true sight
